#Написати функції, що приймають назву файла і:
# 1. читають файл
# 2. повністю переписують його
# 3. додають в нього отриману строку

# 1. читають файл
i = 'tradersong.txt'

f = open(i, 'r', encoding='ANSI')

print(f.read())
f.close()
# відкриваємо файл для читання - "r"

# 2. повністю переписують його
with open('i1', 'w') as f:
    f.write('Stanislav Yermolenko\n')
# 'w' відкриває файл, якщо щось в ньому є все стирає і потім записує

# 3. додають в нього отриману строку
i = [
{
    "name": "Steven",
    "surname": "Jobs"
}
]

with open('s1', 'a') as f:
    for add in i:
        f.write(add['surname'] + ' ' + add['name'] + '\n')
# 'a' добавляє інформацію до існуючого файла
