# Знайти остачу від ділення 121 на 12, і
a = 121 % 12
print(a)

# скільки націло поділиться 134 на 7
b = 134 / 7
b = round(b)
print(b)

# Обчислити 4 в степені 7
a = 4 ** 7
print(a)

# Зробити зріз другої половини довільного списку
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
print(a[len(a) // 2:])

# зробити зріз з 4 го по 8 й елемент списку
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
print(a[3:8])

# дістати зі списку остатній елемент і помножити його на 10
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
print(a[-1] * 10)

# видалити 3й елемент списка і вивести його на екран
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
print(a[2])

# добавити в середину списку новий елемент зі значенням 100
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
a.insert(len(a) // 2, 100)
print(a)

# зробити щоб дві змінні посилалися на один список
a = b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
print(a)
print(b)
